"""Проверка правильности окончания в зависимости от числа"""
a = int(input())
if a % 10 == 1 and a // 10 != 11 and a // 10 != 1\
        and a // 10 != 21 and a // 10 != 31 and a // 10 != 41 and a // 10 != 51 and a // 10 != 61 and a // 10 != 71 and a // 10 != 81 and a // 10 != 91:
    print(a, 'программист')
elif (a % 10) == 2 and a // 10 != 11\
        and a // 10 != 21 and a // 10 != 31 and a // 10 != 41 and a // 10 != 51 and a // 10 != 61 and a // 10 != 71 and a // 10 != 81 and a // 10 != 91\
        or (a % 10) == 3 and a // 10 != 11\
        and a // 10 != 21 and a // 10 != 31 and a // 10 != 41 and a // 10 != 51 and a // 10 != 61 and a // 10 != 71 and a // 10 != 81 and a // 10 != 91\
        or (a % 10) == 4 and a // 10 != 11\
        and a // 10 != 21 and a // 10 != 31 and a // 10 != 41 and a // 10 != 51 and a // 10 != 61 and a // 10 != 71 and a // 10 != 81 and a // 10 != 91:
    print(a, 'программиста')
elif (a % 10) == 5\
        or (a % 10) == 6\
        or (a % 10) == 7\
        or (a % 10) == 8\
        or (a % 10) == 9\
        or (a % 10) == 0\
        or (a % 10) == 1 and a // 10 == 11 or a // 10 == 1\
        or a // 10 == 21 or a // 10 == 31 or a // 10 == 41 or a // 10 == 51 or a // 10 == 61 or a // 10 == 71 or a // 10 == 81 or a // 10 == 91\
        or (a % 10) == 2 and a // 10 == 11\
        or a // 10 == 21 or a // 10 == 31 or a // 10 == 41 or a // 10 == 51 or a // 10 == 61 or a // 10 == 71 or a // 10 == 81 or a // 10 == 91\
        or (a % 10) == 3 and a // 10 == 11\
        or (a % 10) == 4 and a // 10 == 11:
    print(a, 'программистов')